# TrussDuplicateEngineeringType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TrussFailures..::..TrussDuplicateEngineeringType Property
BuiltInFailures..::..TrussFailures Class See Also
---
Elements have duplicate 'Engineering Type' values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TrussDuplicateEngineeringType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussDuplicateEngineeringType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TrussDuplicateEngineeringType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..TrussFailures Class
Autodesk.Revit.DB Namespace